In [64]:
import numpy as np 
import pandas as pd

In [17]:
key = np.array([2, 2, 1, 1, 1])
indexer = key.argsort(kind='heapsort')
print(indexer)
values = np.array(['2:first', '2:second', '1:first', '1:second','1:third'])
values.take(indexer)

[4 2 3 1 0]

array(['1:third', '1:first', '1:second', '2:second', '2:first'],
      dtype='<U8')

In [131]:
def insertfun(value):
    index = arr.searchsorted(value)
    arr[index] = value
arr = np.array([15,8,5,4,6,9])
arr.sort()
print(arr,"\n")
insertfun(7)
arr

array([ 4,  5,  6,  7,  9, 15])

In [210]:
data = {'names': ['ahmed', 'mohammed', 'anas', 'foad', 'loay', 'gamal', 'saed'],
 'ids': ['120215568', '120216874', '120219874', '120214532', '120212258', '120214521', '120217452'],
 'GPAs': [89, 77, 52, 60, 58, 54, 92]}

frame = pd.DataFrame(data)
frame[frame['GPAs'] < 55] = 'w'
frame

      names        ids GPAs
0     ahmed  120215568   89
1  mohammed  120216874   77
2         w          w    w
3      foad  120214532   60
4      loay  120212258   58
5         w          w    w
6      saed  120217452   92

In [191]:
sdata = {'cities': ['Paris', 'Marseille', 'Lyon', 'Toulouse', 'Strasbourg', 'Le Mans'],
 'distance': ['1542.1', '8695.5', '2587.5', '1875.7', '5987.0', '11014.9'],}
obj3 = pd.DataFrame(sdata)
obj3['country'] = 'paris'
obj3

       cities distance country
0       Paris   1542.1   paris
1   Marseille   8695.5   paris
2        Lyon   2587.5   paris
3    Toulouse   1875.7   paris
4  Strasbourg   5987.0   paris
5     Le Mans  11014.9   paris

In [192]:
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 10])
print("Series1:")
print(ds1)
print("Series2:")
print(ds2)
print("Compare the elements of the said Series:")
print("Equals:")
print(ds1 == ds2)
print("Greater than:")
print(ds1 > ds2)
print("Less than:")
print(ds1 < ds2)

Series1:
0     2
1     4
2     6
3     8
4    10
dtype: int64
Series2:
0     1
1     3
2     5
3     7
4    10
dtype: int64
Compare the elements of the said Series:
Equals:
0    False
1    False
2    False
3    False
4     True
dtype: bool
Greater than:
0     True
1     True
2     True
3     True
4    False
dtype: bool
Less than:
0    False
1    False
2    False
3    False
4    False
dtype: bool

In [206]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
s1 = pd.Series(df['col1'])
print("\n1st column as a Series:")
print(s1)
print(type(s1))

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

1st column as a Series:
0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64
<class 'pandas.core.series.Series'>